[
    {
        "id": "1",
        "title": "Sono Bisque Doll wa Koi wo Suru",
        "imageUrl": "1.webp",
        "rating": 9.7,
        "genre": "Comedy, Romance, School Life",
        "description": "High school student Wakana Gojou spends his days perfecting the art of making hina dolls, hoping to eventually reach his grandfather's level of expertise. While his fellow teenagers busy themselves with pop culture, Gojou finds bliss in sewing clothes for his dolls. Nonetheless, he goes to great lengths to keep his unique hobby a secret, as he believes that he would be ridiculed were it revealed.",
        "screenshots": [
            "1.webp",
            "2.webp",
            "3.webp"
        ],
        "videoUrl": "https://www.youtube.com/watch?v=WhQg-nhpxuQ"
    },
    {
        "id": "2",
        "title": "Kenja no Mago",
        "imageUrl": "2.webp",
        "rating": 9.4,
        "genre": "Adventure, Comedy, Fantasy",
        "description": "A young man who had surely died in an accident, was reborn in another world as a baby! After that, he was picked up by the patriot hero 'Sage' Merlin Wolford and was given the name Shin. He was raised as a grandson by Merlin and soaked up Merlin's teachings earning him some shocking power however, when he became 15 his grandfather Merlin said: 'I forgot to teach him common sense'!",
        "screenshots": [
            "1.webp",
            "2.webp",
            "3.webp"
        ],
        "videoUrl": "https://www.youtube.com/watch?v=76rrM_R0zdI"
    },
    {
        "id": "3",
        "title": "Boruto: Naruto Next Generations",
        "imageUrl": "3.webp",
        "rating": 9.5,
        "genre": "Comedy, Romance, School Life",
        "description": "Following the successful end of the Fourth Shinobi World War, Konohagakure has been enjoying a period of peace, prosperity, and extraordinary technological advancement. This is all due to the efforts of the Allied Shinobi Forces and the village's Seventh Hokage, Naruto Uzumaki. Now resembling a modern metropolis, Konohagakure has changed, particularly the life of a shinobi. Under the watchful eye of Naruto and his old comrades, a new generation of shinobi has stepped up to learn the ways of the ninja.",
        "screenshots": [
            "1.webp",
            "2.webp",
            "3.webp"
        ],
        "videoUrl": "https://www.youtube.com/watch?v=A6Aq6VlOw7I"
    },
    {
        "id": "4",
        "title": "FullMetal Alchemist",
        "imageUrl": "4.webp",
        "rating": 10,
        "genre": "Action, Magic, School",
        "description": "After a horrific alchemy experiment goes wrong in the Elric household, brothers Edward and Alphonse are left in a catastrophic new reality. Ignoring the alchemical principle banning human transmutation, the boys attempted to bring their recently deceased mother back to life. Instead, they suffered brutal personal loss: Alphonse's body disintegrated while Edward lost a leg and then sacrificed an arm to keep Alphonse's soul in the physical realm by binding it to a hulking suit of armor.",
        "screenshots": [
            "1.webp",
            "2.webp",
            "3.webp"
        ],
        "videoUrl": "https://www.youtube.com/watch?v=1dNkQoE76nY"
    },
    {
        "id": "5",
        "title": "Otome Game Sekai wa Mob ni Kibishii Sekai desu",
        "imageUrl": "5.webp",
        "rating": 9.3,
        "genre": "Comedy, Romance, School Life",
        "description": "Blackmailed into playing a dating simulator set in a matriarchy, an ordinary man must put up with the unbearable and convoluted world until he clears the game. After countless days of grinding, he finally manages to beat it, but his hardcore gaming comes at a cost: extreme sleep deprivation and hunger.",
        "screenshots": [
            "1.webp",
            "2.webp",
            "3.webp"
        ],
        "videoUrl": "https://www.youtube.com/watch?v=vLQd4xIZnN0"
    },
    {
        "id": "6",
        "title": "Jujutsu Kaisen",
        "imageUrl": "6.webp",
        "rating": 8.7,
        "genre": "Adventure, Comedy, Fantasy",
        "description": "Idly indulging in baseless paranormal activities with the Occult Club, high schooler Yuuji Itadori spends his days at either the clubroom or the hospital, where he visits his bedridden grandfather. However, this leisurely lifestyle soon takes a turn for the strange when he unknowingly encounters a cursed item. Triggering a chain of supernatural occurrences, Yuuji finds himself suddenly thrust into the world of Curses—dreadful beings formed from human malice and negativity—after swallowing the said item, revealed to be a finger belonging to the demon Sukuna Ryoumen, the 'King of Curses'.",
        "screenshots": [
            "1.webp",
            "2.webp",
            "3.webp"
        ],
        "videoUrl": "https://www.youtube.com/watch?v=GwaRztMaoY0"
    },
    {
        "id": "7",
        "title": "Attack on Titan",
        "imageUrl": "7.webp",
        "rating": 9,
        "genre": "Comedy, Romance, School Life",
        "description": "Centuries ago, mankind was slaughtered to near extinction by monstrous humanoid creatures called Titans, forcing humans to hide in fear behind enormous concentric walls. What makes these giants truly terrifying is that their taste for human flesh is not born out of hunger but what appears to be out of pleasure. To ensure their survival, the remnants of humanity began living within defensive barriers, resulting in one hundred years without a single titan encounter. However, that fragile calm is soon shattered when a colossal Titan manages to breach the supposedly impregnable outer wall, reigniting the fight for survival against the man-eating abominations.",
        "screenshots": [
            "1.webp",
            "2.webp",
            "3.webp"
        ],
        "videoUrl": "https://www.youtube.com/watch?v=StLX4kITjWU"
    },
    {
        "id": "8",
        "title": "Spy x Family",
        "imageUrl": "8.webp",
        "rating": 9.2,
        "genre": "Adventure, Comedy, Fantasy",
        "description": "Corrupt politicians, frenzied nationalists, and other warmongering forces constantly jeopardize the thin veneer of peace between neighboring countries Ostania and Westalis. In spite of their plots, renowned spy and master of disguise 'Twilight' fulfills dangerous missions one after another in the hope that no child will have to experience the horrors of war.",
        "screenshots": [
            "1.webp",
            "2.webp",
            "3.webp"
        ],
        "videoUrl": "https://www.youtube.com/watch?v=8mntkBzeEWU"
    },
    {
        "id": "9",
        "title": "Mahoutsukai Reimeiki",
        "imageUrl": "9.webp",
        "rating": 9.1,
        "genre": "Comedy, Romance, School Life",
        "description": "Although he attends the Royal Magic Academy in the Kingdom of Wenias, Sable has the worst grades in the entire school. As he has no memories of his time before attending the institution, when Headmaster Albus tasks him with a special training regimen in the south, Sable eagerly accepts it. Alongside the Dawn Witch, Roux Cristasse; Holt, a human girl with antlers; and Kudd, a lizard Beastfallen, Sable must establish a village of witches in a region where anti-witch sentiment remains strong.",
        "screenshots": [
            "1.webp",
            "2.webp",
            "3.webp"
        ],
        "videoUrl": "https://www.youtube.com/watch?v=CMrljs9_yyY"
    },
    {
        "id": "10",
        "title": "Bleach: Sennen Kessen-hen",
        "imageUrl": "10.webp",
        "rating": 9.4,
        "genre": "Comedy, Romance, School Life",
        "description": "Substitute Soul Reaper Ichigo Kurosaki spends his days fighting against Hollows, dangerous evil spirits that threaten Karakura Town. Ichigo carries out his quest with his closest allies: Orihime Inoue, his childhood friend with a talent for healing; Yasutora Sado, his high school classmate with superhuman strength; and Uryuu Ishida, Ichigo's Quincy rival.",
        "screenshots": [
            "1.webp",
            "2.webp",
            "3.webp"
        ],
        "videoUrl": "https://www.youtube.com/watch?v=mjeR7vUrDvM"
    },
    {
        "id": "11",
        "title": "Gintama",
        "imageUrl": "11.webp",
        "rating": 9.8,
        "genre": "Adventure, Comedy, Fantasy",
        "description": "After a one-year hiatus, Shinpachi Shimura returns to Edo, only to stumble upon a shocking surprise: Gintoki and Kagura, his fellow Yorozuya members, have become completely different characters! Fleeing from the Yorozuya headquarters in confusion, Shinpachi finds that all the denizens of Edo have undergone impossibly extreme changes, in both appearance and personality. Most unbelievably, his sister Otae has married the Shinsengumi chief and shameless stalker Isao Kondou and is pregnant with their first child.",
        "screenshots": [
            "1.webp",
            "2.webp",
            "3.webp"
        ],
        "videoUrl": "https://www.youtube.com/watch?v=fXuOaxrXYqw"
    },
    {
        "id": "12",
        "title": "Kaguya-sama wa Kokurasetai: Ultra Romantic",
        "imageUrl": "12.webp",
        "rating": 9.7,
        "genre": "Comedy, Romance, School Life",
        "description": "The elite members of Shuchiin Academy's student council continue their competitive day-to-day antics. Council president Miyuki Shirogane clashes daily against vice-president Kaguya Shinomiya, each fighting tooth and nail to trick the other into confessing their romantic love. Kaguya struggles within the strict confines of her wealthy, uptight family, rebelling against her cold default demeanor as she warms to Shirogane and the rest of her friends.",
        "screenshots": [
            "1.webp",
            "2.webp",
            "3.webp"
        ],
        "videoUrl": "https://www.youtube.com/watch?v=FC5TqeS9ATo"
    },
    {
        "id": "13",
        "title": "Douluo Dalu",
        "imageUrl": "13.webp",
        "rating": 9.8,
        "genre": "Adventure, Comedy, Fantasy",
        "description": "Tang San is one of Tang Sect martial art clan's most prestigious disciples and peerless in the use of hidden weapons. With high expectations, the sect's elders believe his future will be bright; yet Tang chooses to forsake this life at the cost of obtaining the sect's forbidden lore—an action punishable by death. Tang, now content with his ascension of knowledge, sees no reason to keep on living and jumps from Hell's Peak, but little did he know that that would not be the end of his existence.",
        "screenshots": [
            "1.webp",
            "2.webp",
            "3.webp"
        ],
        "videoUrl": "https://www.youtube.com/watch?v=OjnSQvQFA4o"
    },
    {
        "id": "14",
        "title": "Ginga Eiyuu Densetsu",
        "imageUrl": "14.webp",
        "rating": 9.9,
        "genre": "Action, Magic, School",
        "description": "The 150-year-long stalemate between the two interstellar superpowers, the Galactic Empire and the Free Planets Alliance, comes to an end when a new generation of leaders arises: the idealistic military genius Reinhard von Lohengramm, and the FPA's reserved historian, Yang Wenli.",
        "screenshots": [
            "1.webp",
            "2.webp",
            "3.webp"
        ],
        "videoUrl": "https://www.youtube.com/watch?v=G6jLt3l7QQ0"
    },
    {
        "id": "15",
        "title": "Fruits Basket: The Final",
        "imageUrl": "15.webp",
        "rating": 9.4,
        "genre": "Comedy, Romance, School Life",
        "description": "Hundreds of years ago, the Chinese Zodiac spirits and their god swore to stay together eternally. United by this promise, the possessed members of the Souma family shall always return to each other under any circumstances. Yet, when these bonds shackle them from freedom, it becomes an undesirable burden—a curse. As head of the clan, Akito is convinced that he shares a special connection with the other Soumas. While he desperately clings to this fantasy, the rest of the family remains isolated and suppressed by the fear of punishment.",
        "screenshots": [
            "1.webp",
            "2.webp",
            "3.webp"
        ],
        "videoUrl": "https://www.youtube.com/watch?v=b_lLW4eQc1Q"
    },
    {
        "id": "16",
        "title": "Clannad: After Story",
        "imageUrl": "16.webp",
        "rating": 9.1,
        "genre": "Adventure, Comedy, Fantasy",
        "description": "Clannad: After Story, the sequel to the critically acclaimed slice-of-life series Clannad, begins after Tomoya Okazaki and Nagisa Furukawa graduate from high school. Together, they experience the emotional rollercoaster of growing up. Unable to decide on a course for his future, Tomoya learns the value of a strong work ethic and discovers the strength of Nagisa's support. Through the couple's dedication and unity of purpose, they push forward to confront their personal problems, deepen their old relationships, and create new bonds.",
        "screenshots": [
            "1.webp",
            "2.webp",
            "3.webp"
        ],
        "videoUrl": "https://www.youtube.com/watch?v=hVMJxT3O9qA"
    },
    {
        "id": "17",
        "title": "Koe no Katachi",
        "imageUrl": "17.webp",
        "rating": 9.2,
        "genre": "Action, Magic, School",
        "description": "Elementary school student Shouya Ishida is creeped out when Shouko Nishimiya, a meek girl born with impaired hearing, transfers into his class. Following her arrival, Shouya and his friends begin to torment Shouko, making her the hapless target of ridicule and assault. The constant bullying turns school into a living hell for Shouko, where even the teachers remain indifferent to the situation.",
        "screenshots": [
            "1.webp",
            "2.webp",
            "3.webp"
        ],
        "videoUrl": "https://www.youtube.com/watch?v=Zp9nCw96uWA"
    },
    {
        "id": "18",
        "title": "Kimi no Na wa",
        "imageUrl": "18.webp",
        "rating": 9.7,
        "genre": "Adventure, Comedy, Fantasy",
        "description": "Mitsuha Miyamizu, a high school girl, yearns to live the life of a boy in the bustling city of Tokyo—a dream that stands in stark contrast to her present life in the countryside. Meanwhile in the city, Taki Tachibana lives a busy life as a high school student while juggling his part-time job and hopes for a future in architecture.",
        "screenshots": [
            "1.webp",
            "2.webp",
            "3.webp"
        ],
        "videoUrl": "https://www.youtube.com/watch?v=ylynqmzt53w"
    },
    {
        "id": "19",
        "title": "Kimetsu no Yaiba: Yuukaku-hen",
        "imageUrl": "19.webp",
        "rating": 9.4,
        "genre": "Comedy, Romance, School Life",
        "description": "The devastation of the Mugen Train incident still weighs heavily on the members of the Demon Slayer Corps. Despite being given time to recover, life must go on, as the wicked never sleep: a vicious demon is terrorizing the alluring women of the Yoshiwara Entertainment District. The Sound Pillar, Tengen Uzui, and his three wives are on the case. However, when he soon loses contact with his spouses, Tengen fears the worst and enlists the help of Tanjirou Kamado, Zenitsu Agatsuma, and Inosuke Hashibira to infiltrate the district's most prominent houses and locate the depraved Upper Rank demon.",
        "screenshots": [
            "1.webp",
            "2.webp",
            "3.webp"
        ],
        "videoUrl": "https://www.youtube.com/watch?v=tYDJHZT_bm8"
    },
    {
        "id": "20",
        "title": "Demon Slayer: Kimetsu no Yaiba",
        "imageUrl": "20.webp",
        "rating": 9,
        "genre": "Action, Magic, School",
        "description": "Ever since the death of his father, the burden of supporting the family has fallen upon Tanjirou Kamado's shoulders. Though living impoverished on a remote mountain, the Kamado family are able to enjoy a relatively peaceful and happy life. One day, Tanjirou decides to go down to the local village to make a little money selling charcoal. On his way back, night falls, forcing Tanjirou to take shelter in the house of a strange man, who warns him of the existence of flesh-eating demons that lurk in the woods at night.",
        "screenshots": [
            "1.webp",
            "2.webp",
            "3.webp"
        ],
        "videoUrl": "https://www.youtube.com/watch?v=vFFyX928D9k"
    }
]